define(["utils", 'bootstrap-daterangepicker','css!bootstrap_daterangepicker_css'], function (Utils) {
    return ['$scope', '$http', '$alertService', function ($scope, $http, $alert) {
        $scope.checked = 1;
        $scope.province = "请选择省";
        //$scope.provinces = [
        //    "请选择省", "北京", "上海", "天津", "重庆", "河北", "山西", "内蒙古",
        //    "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东",
        //    "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南",
        //    "西藏", "陕西", "甘肃", "宁夏", "青海", "新疆", "香港", "澳门", "台湾"];
        $scope.provinces = ["请选择省","北京市","天津市","上海市","重庆市","河北省","河南省","云南省","辽宁省","黑龙江省","湖南省","安徽省","山东省","新疆维吾尔自治区","江苏省","浙江省","江西省","湖北省","广西壮族","甘肃省","山西省","内蒙古自治区","陕西省","吉林省","福建省","贵州省","广东省","青海省","西藏","四川省","宁夏回族","海南省","台湾省","香港特别行政区","澳门特别行政区"];
        $scope.city = "请选择市";
        //$scope.citys = {
        //    "请选择省": ["请选择市"],
        //    "北京": ["北京"],
        //    "上海": ["上海"],
        //    "天津": ["天津"],
        //    "重庆": ["重庆"],
        //    "河北": ["石家庄","邯郸","邢台","保定","张家口","承德","廊坊","唐山","秦皇岛","沧州","衡水"],
        //    "山西": ["太原","大同","阳泉","长治","晋城","朔州","吕梁","忻州","晋中","临汾","运城"],
        //    "内蒙古": ["呼和浩特","包头","乌海","赤峰","呼伦贝尔","阿拉善","哲里木","兴安","乌兰察布","锡林郭勒","巴彦淖尔","伊克昭"],
        //    "辽宁": ["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"],
        //    "吉林": ["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"],
        //    "黑龙江": ["哈尔滨","齐齐哈尔","牡丹江","佳木斯","大庆","绥化","鹤岗","鸡西","黑河","双鸭山","伊春","七台河","大兴安岭"],
        //    "江苏": ["南京","镇江","苏州","南通","扬州","盐城","徐州","连云港","常州","无锡","宿迁","泰州","淮安"],
        //    "浙江": ["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"],
        //    "安徽": ["合肥","芜湖","蚌埠","马鞍山","淮北","铜陵","安庆","黄山","滁州","宿州","池州","淮南","巢湖","阜阳","六安","宣城","亳州"],
        //    "福建": ["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德"],
        //    "江西": ["南昌市","景德镇","九江","鹰潭","萍乡","新馀","赣州","吉安","宜春","抚州","上饶"],
        //    "山东": ["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","莱芜","临沂","德州","聊城","滨州","菏泽"],
        //    "河南": ["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店","济源"],
        //    "湖北": ["武汉","宜昌","荆州","襄樊","黄石","荆门","黄冈","十堰","恩施","潜江","天门","仙桃","随州","咸宁","孝感","鄂州"],
        //    "湖南": ["长沙","常德","株洲","湘潭","衡阳","岳阳","邵阳","益阳","娄底","怀化","郴州","永州","湘西","张家界"],
        //    "广东": ["广州","深圳","珠海","汕头","东莞","中山","佛山","韶关","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","潮州","揭阳","云浮"],
        //    "广西": ["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","南宁地区","柳州地区","贺州","百色","河池"],
        //    "海南": ["海口","三亚"],
        //    "四川": ["成都","绵阳","德阳","自贡","攀枝花","广元","内江","乐山","南充","宜宾","广安","达川","雅安","眉山","甘孜","凉山","泸州"],
        //    "贵州": ["贵阳","六盘水","遵义","安顺","铜仁","黔西南","毕节","黔东南","黔南"],
        //    "云南": ["昆明","大理","曲靖","玉溪","昭通","楚雄","红河","文山","思茅","西双版纳","保山","德宏","丽江","怒江","迪庆","临沧"],
        //    "西藏": ["拉萨","日喀则","山南","林芝","昌都","阿里","那曲"],
        //    "陕西": ["西安","宝鸡","咸阳","铜川","渭南","延安","榆林","汉中","安康","商洛"],
        //    "甘肃": ["兰州","嘉峪关","金昌","白银","天水","酒泉","张掖","武威","定西","陇南","平凉","庆阳","临夏","甘南"],
        //    "宁夏": ["银川","石嘴山","吴忠","固原"],
        //    "青海": ["西宁","海东","海南","海北","黄南","玉树","果洛","海西"],
        //    "新疆": ["乌鲁木齐","石河子","克拉玛依","伊犁","巴音郭勒","昌吉","克孜勒苏柯尔克孜","博","尔塔拉","吐鲁番","哈密","喀什","和田","阿克苏"],
        //    "香港": ["香港"],
        //    "澳门": ["澳门"],
        //    "台湾": ["台北","高雄","台中","新竹","基隆","台南","嘉义"]};
        $scope.cities = {
            "请选择省": ['请选择市'],
            "北京市": ['北京市'],
            "天津市": ['天津市'],
            "上海市": ['上海市'],
            "重庆市": ['重庆市'],
            "河北省": ['石家庄市', '唐山市', '秦皇岛市', '邯郸市', '邢台市', '保定市', '张家口市', '承德市', '沧州市', '廊坊市', '衡水市'],
            "河南省": ['郑州市', '开封市', '洛阳市', '平顶山市', '安阳市', '鹤壁市', '新乡市', '焦作市', '济源市', '濮阳市', '许昌市', '漯河市', '三门峡市', '南阳市', '商丘市', '信阳市', '周口市', '驻马店市'],
            "云南省": ['昆明市', ' 曲靖市', '玉溪市', '保山市', '昭通市', '丽江市', '思茅市', '临沧市', '楚雄彝族自治州', '红河哈尼族彝族自治州', '文山壮族苗族自治州', '西双版纳傣族自治州', '大理白族自治州', '德宏傣族景颇族自治州', '怒江傈僳族自治州', '迪庆藏族自治州'],
            "辽宁省": ['沈阳市', '大连市', '鞍山市', '抚顺市', '本溪市', '丹东市', '锦州市', '营口市', '阜新市', '辽阳市', '盘锦市', '铁岭市', '朝阳市', '葫芦岛市'],
            "黑龙江省": ['哈尔滨市', '齐齐哈尔市', '鸡西市', '鹤岗市', '双鸭山市', '大庆市', '伊春市', '佳木斯市', '七台河市', '牡丹江市', '黑河市', '绥化市', '大兴安岭地区'],
            "湖南省": ['长沙市', '株洲市', '湘潭市', '衡阳市', '邵阳市', '岳阳市', '常德市', '张家界市', '益阳市', '郴州市', '永州市', '怀化市', '娄底市', '湘西土家族苗族自治州'],
            "安徽省": ['合肥市', '芜湖市', '蚌埠市', '淮南市', '马鞍山市', '淮北市', '铜陵市', '安庆市', '黄山市', '滁州市', '阜阳市', '宿州市', '巢湖市', '六安市', '亳州市', '池州', '宣城市'],
            "山东省": ['济南市', '青岛市', '淄博市', '枣庄市', '东营市', '烟台市', '潍坊市', '济宁市', '泰安市', '威海市', '日照市', '莱芜市', '临沂市', '德州市', '聊城市', '滨州市', '菏泽市'],
            "新疆维吾尔自治区": ['乌鲁木齐市', '克拉玛依市', '吐鲁番地区', '哈密地区', '昌吉回族自治州 ', '博尔塔拉蒙古自治州 ', '巴音郭楞蒙古自治州 ', '阿克苏地区', '克孜勒苏柯尔克孜自治州 ', '喀什地区', '和田地区', '伊犁哈萨克自治州', '塔城地区', '阿勒泰地区', '石河子市', '阿拉尔市', '图木舒克市', '五家渠市'],
            "江苏省": ['南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港市', '淮安市', '盐城市', '扬州市', '镇江市', '泰州市', '宿迁市'],
            "浙江省": ['杭州市', '宁波市', '温州市', '嘉兴市', '湖州市', '绍兴市', '金华市', '衢州市', '舟山市', '台州市', '丽水市'],
            "江西省": ['南昌市', '景德镇市', '萍乡市', '九江市', '新余市', '鹰潭市', '赣州市', '吉安市', '宜春市', '抚州市', '上饶市'],
            "湖北省": ['武汉市', '黄石市', '十堰市', '宜昌市', '襄樊市', '鄂州市', '荆门市', '孝感市', '荆州市', '黄冈市', '咸宁市', '随州市', '恩施土家族苗族自治州', '仙桃市', '潜江市', '天门市', '神农架林区'],
            "广西壮族": ['南宁市', '柳州市', '桂林市', '梧州市', '北海市', '防城港市', '钦州市', '贵港市', '玉林市', '百色市', '贺州市', '河池市', '来宾市', '崇左市'],
            "甘肃省": ['兰州市', '嘉峪关市', '金昌市', '白银市', '天水市', '武威市', '张掖市', '平凉市', '酒泉市', '庆阳市', '定西市', '陇南市', '临夏回族自治州', '甘南藏族自治州'],
            "山西省": ['太原市', '大同市', '阳泉市', '长治市', '晋城市', '朔州市', '晋中市', '运城市', '忻州市', '临汾市', '吕梁市'],
            "内蒙古自治区": ['呼和浩特市', '包头市', '乌海市', '赤峰市', '通辽市', '鄂尔多斯市', '呼伦贝尔市', '巴彦淖尔市', '乌兰察布市', '兴安盟', '锡林郭勒盟', '阿拉善盟'],
            "陕西省": ['西安市', '铜川市', '宝鸡市', '咸阳市', '渭南市', '延安市', '汉中市', '榆林市', '安康市', '商洛市'],
            "吉林省": ['长春市', '吉林市', '四平市', '辽源市', '通化市', '白山市', '松原市', '白城市', '延边朝鲜族自治州'],
            "福建省": ['福州市', '厦门市', '莆田市', '三明市', '泉州市', '漳州市', '南平市', '龙岩市', '宁德市'],
            "贵州省": ['贵阳市', '六盘水市', '遵义市', '安顺市', '铜仁地区', '黔西南布依族苗族自治州', '毕节地区', '黔东南苗族侗族自治州', '黔南布依族苗族自治州'],
            "广东省": ['广州市', '韶关市', '深圳市', '珠海市', '汕头市', '佛山市', '江门市', '湛江市', '茂名市', '肇庆市', '惠州市', '梅州市', '汕尾市', '河源市', '阳江市', '清远市', '东莞市', '中山市', '潮州市', '揭阳市', '云浮市'],
            "青海省": ['西宁市', '海东地区', '海北藏族自治州', '黄南藏族自治州', '海南藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州'],
            "西藏": ['拉萨市', '昌都地区', '山南地区', '日喀则地市', '那曲地区', '阿里地区', '林芝地区'],
            "四川省": ['成都市', '自贡市', '攀枝花市', '泸州市', '德阳市', '绵阳市', '广元市', '遂宁市', '内江市', '乐山市', '南充市', '眉山市', '宜宾市', '广安市', '达州市', '雅安市', '巴中市', '资阳市', '阿坝藏族羌族自治州', '甘孜藏族自治州', '凉山彝族自治州'],
            "宁夏回族": ['银川市', '石嘴山市', '吴忠市', '固原市', '中卫市'],
            "海南省": ['海口市', '三亚市', '五指山市', '琼海市', '儋州市', '文昌市', '万宁市', '东方市', '定安县', '屯昌县', '澄迈县', '临高县', '白沙黎族自治县', '昌江黎族自治县', '乐东黎族自治县', '陵水黎族自治县', '保亭黎族苗族自治县', '琼中黎族苗族自治县'],
            "台湾省": ['台北市', '高雄市', '基隆市', '台中市', '台南市', '新竹市', '嘉义市'],
            "香港特别行政区": ['香港'],
            "澳门特别行政区": ['澳门']
        };
        $scope.selectPro = function () {
            $scope.city = $scope.cities[$scope.province][0];
        };
        $scope.triggerSelect = function () {
            angular.element('#file_dong_AP_id').trigger('click');
        };
        $scope.fileChange = function (element) {
            $scope.$apply(function (scope) {
                scope.inputFile = element.files[0];
            });
        };

        var tableTitle = getRcString("WARING_ITEM").split(",");
        var devMode = $scope.sceneInfo.sn;

        function getRcString(attrName) {
            return Utils.getRcString("mapconfig_rc", attrName);
        }

        $scope.options = {
            url: "../../../init/mapconfig/init.json",
            showCheckBox: true,
            columns: [
                {sortable: true, field: "area_name", title: getRcString("AREANAME")},
                {sortable: true, field: "area_type", title: getRcString("AREATYPE")}
            ],
            pageList: "[10, 20]",
            pagination: true//,
            //sidePagination: 'server'
        };
    }];
});