;(function ($) {
     var MODULE_BASE = "dpi_user";
     var MODULE_NAME = MODULE_BASE + ".dpi_userstatics";
     //var g_sn = FrameInfo.ACSN;
     var g_userName = FrameInfo.g_user.user;
     var g_sn = [];
     var LIMIT_NUMBER = 10000;//一次获取的数据条数
     var g_UserMsg = []  //保存用户id 用户名称  对应的MAC地址数组 存放形式 [{userId:"",name:"",macaddr:[xxx,xxx]}]
     var g_SelectTime = 0;//当前选择的时间
    function getRcText(sRcName)
    {
    return Utils.Base.getRcString("User_monitor_rc", sRcName);
    } 
    //获取时间函数
    function getTheDate(str1,str2)
    {
        var nyear = new Date().getFullYear();
        var nmonth = new Date().getMonth();
        var nday = new Date().getDate();
        var nHour = new Date().getHours();
        if(str1=="one")
        { 
            var nDATA = 24
            var tNow = new Date(nyear,nmonth,nday,nDATA); 
            var noneHour = 3600*1000
            
            if(str2=="end")
            {
               
                return tNow-0
            }
            if(str2 =="start")
            {
                
                return tNow - noneHour*(nDATA)
            }
        }
        if(str1=="month")
        {
            var nDATA = 30;
            var aHour = 24*3600*1000;
            var aOptTime = [];
            var tNow = new Date(nyear,nmonth,nday,24); 
            
            if(str2=="end")
            {
                 
                return tNow - 0
            }
            if(str2 =="start")
            {
               
                return tNow - aHour*(nDATA)
            }
        }
        if(str1=="year")
        {
            var nDATA = 365;
            var aHour = 24*3600*1000;
            var aOptTime = [];
           var tNow = new Date(nyear,nmonth,nday,24); 
            
            if(str2=="end")
            {
                
                 return tNow - 0
            }
            if(str2 =="start")
            {
               
               return tNow - aHour*(nDATA)
            }
        }
        if(str1=="aweek")
        {
            var nDATA = 7;
            var aHour = 24*3600*1000;
            var aOptTime = [];
            var tNow = new Date(nyear,nmonth,nday,24); 
          
            if(str2=="end")
            { 
                 return tNow - 0
            }
            if(str2=="start")
            { 
                return tNow - aHour*(nDATA)
            }
        }
    }
    /*饼图图例显示在中间*/
    function topChange(top, lineHeight,sum, mixTop)//中间点距离上边高度， 行高， 数量， 最小上边距
    {
        if(mixTop != undefined)
        {
            if(top - sum * lineHeight / 2 < mixTop)
            {
                return mixTop;
            }
        }
        return parseInt(top - sum * lineHeight / 2);
    }
    /*获取当前登录用户的所有ACSN*/
    function getACSN()
    {
        var startTime = getTheDate("one","start");
        var endTime = getTheDate("one","end"); 
        /*发送请求获取本用户下的ACSN*/
          var SendMsg = { 
                url: MyConfig.path + "/scenarioserver",
                dataType: "json",
                type: "post", 
                data: { 
                    Method: 'getdevListByUser',
                    param: {
                         userName:g_userName,
                    }
                },
                onSuccess:getSuccess,
                onFailed:getFail 
            }
            Utils.Request.sendRequest(SendMsg);
            function getSuccess(aData)
            {
                var adata = aData.message;
                for(var i=0;i<adata.length;i++)
                {
                    g_sn.push(adata[i].devSN);
                }
                /*用户身份相关的在此初始化*/
                 /*发送请求获取用户信息*/
                AjaxGetUserMsg(startTime,endTime,"start");
                /*新老用户显示比例*/ 
                UserRate(startTime,endTime); 
                /*上线次数*/
                UserVisiteCount(startTime,endTime);
                /*用户访问饼图*/
                UserAccessNum(startTime,endTime)
                /*dpi数据分析*/
                dpiData(startTime,endTime);
                /*用户访问趋势*/
                AccessUser_chart(startTime,endTime); 
                /*位置信息*/
                LocaltionData(startTime,endTime);
                
            }
            function getFail()
            {
                return;
            }
    }
    
    /*显示新老用户比例饼图*/ 
    function UserRate_pie(newUser,oldUser)
    {
        if(newUser == 0 && oldUser == 0)
        {
            var opt = {
                calculable : false,
                height:150,
                tooltip : {
                    show:false
                },
                series : [
                    {
                        type: 'pie',
                        radius: ['40%', '80%'],
                        center: ['40%', '47%'],
                        itemStyle: {
                            normal: {
                                labelLine:{
                                    show:false
                                },
                                label:
                                {
                                    show:false
                                }
                            }
                        },
                        data: [{name:"",value:1}]
                    }
                ]
            };
            var oTheme = {color: ['#B7ADAD']};
            $("#UserRate_pie").echart("init", opt,oTheme);  
        }
        else
        {
            var labelNew = {
            normal:{
                label:{
                    show:true,
                    position:'center',
                    formatter:'{b}',
                    textStyle:{
                        baseline:'bottom'
                    },
                },
                labelLine:{
                    show:false
                }
            }
            };
            var labelold = {
                normal: {
                    color:'#ccc',

                    label: {
                        show:true,
                        position:'center',

                    },
                    labelLine:{
                        show:false
                    },

                },
                emphasis:{
                    color:'rgba(0,0,0,0)'
                }
            };
            var adata = [{name:"新用户",value:newUser,itemStyle:labelNew},
             {name:"老用户",value:oldUser,itemStyle:labelold}];
             /*注：下面圆环里面的比例要自己算*/
             var totalUser = newUser+oldUser; 
             var nval = Number(((newUser/totalUser)*100).toFixed(0));
            var labelFromatter = {
                normal: {
                    label: {
                        formatter:nval + '%',
                        textStyle: {
                            baseline: 'top'
                        }
                    }
                }
            }; 
            opt = {
                calculable : false,
                height:150,
                series : [
                    {
                        type: 'pie',
                        radius: ['40%', '80%'],
                        center: ['45%', '47%'],
                        itemStyle:labelFromatter,
                        data: adata
                    }
                ]

            };
            var oTheme = {
                   color : ['#CC324B','#53B9E7','#69C4C5','#FFBB33','#FF8800','#D7DDE4']
                }; 
            $("#UserRate_pie").echart("init", opt);  
        } 
             
        
    }
    /*新老用户比*/
    function UserRate(sStartTime,sEndTime)
    {
        var SendMsg = {
                url: MyConfig.path + "/useridentity/getNewOldUserNumber",
                dataType: "json",
                type: "post", 
                data: { 
                    devSNList:g_sn,
                    startTime:new Date(sStartTime).toISOString(),
                    endTime:new Date(sEndTime).toISOString(), 
                },
                onSuccess:getMsgSuccess,
                onFailed:getMsgFail
            } 
            Utils.Request.sendRequest(SendMsg);
            function getMsgSuccess(data){
                  UserRate_pie(data.newUserNumber,data.oldUserNumber);
                  $("#TotalUser").html(data.newUserNumber+data.oldUserNumber+"人");
                  $("#NewUser").html(data.newUserNumber+"人");
                  $("#OldUser").html(data.oldUserNumber+"人");
            }
            function getMsgFail(){
                return;
            }
       
    }
    
    /*上网信息和位置信息折线图*/
    function drowLocaltionAndDpiChart(aTime,aSeries,ChartId)
    {
          var option = { 
            height: 200, 
            tooltip: {
                show: true,
                trigger: 'axis',
                axisPointer: {
                    type: 'line',
                    lineStyle: {
                        color: '#373737',
                        width: 1,
                        type: 'solid'
                    }
                }
            },
           /*legend: {
                data:['应用','上网']
            },*/
           // dataZoom:dataZoom,
            grid: {
                x: 70,
                y: 40,
                x2: 30,
                y2: 45, //45
                borderColor: '#415172'
            },
            calculable: false,
            xAxis: [
                {
                    type: 'category',
                    boundaryGap: false,
                    splitLine:{
                            show:true,
                            lineStyle :{color: '#F5F5F5', width: 1}
                        },
                    name:getRcText("TIME"),//"时间",
                    nameTextStyle: {color: "gray"},
                    axisLabel: {
                       // rotate: 45, //横轴的倾斜程度
                        show: true,
                        textStyle: {color: '#000', width: 2}
                    },
                    axisLine: {
                        show: true,
                        lineStyle: {color: '#F5F5F5', width: 1}
                    },
                    axisTick: {
                        show: false
                    },
                    data: aTime,
                }
            ],

            yAxis:[
                {
                    type: 'value',
                    name:getRcText("MANNUM"),//"人数",
                    nameTextStyle: {color: "gray"},
                    splitLine:{
                            show:true,
                            lineStyle :{color: '#F5F5F5', width: 1}
                        },
                    axisLabel: {
                        show: true,
                        //textStyle: {color: '#47495d', width: 2}
                        textStyle: {color: '#000', width: 2}
                    },
                    axisLine: {
                        show: true,
                        lineStyle: {color: '#F5F5F5', width: 1}
                    }  
                }
            ],
            series:aSeries  
        };
        var oTheme = {
             color : ['#53B9E7','#31ADB4','#69C4C5','#FFBB33','#FF8800','#CC324B','#E64C65','#D7DDE4'],
            valueAxis: {
                splitLine: {lineStyle: {color: ['#415172']}},
                axisLabel: {textStyle: {color: ['#abbbde']}}
            },
            categoryAxis: {
                splitLine: {lineStyle: {color: ['#415172']}}
            }
        }

        $(ChartId).echart("init", option, oTheme); 
    }
     /*上网信息和位置信息饼图*/
    function drowDpiAndLocaltionPie(aData,aPieId)
    {
        if(aData.length == 0)
        {
            var option = {
                calculable : false,
                height:200,
                tooltip : {
                    show:false
                },
                series : [
                    {
                        type: 'pie',
                        radius: ['35%', '65%'],
                        center: ['25%', '47%'],
                        itemStyle: {
                            normal: {
                                labelLine:{
                                    show:false
                                },
                                label:
                                {
                                    show:false
                                }
                            }
                        },
                        data: [{name:"",value:1}]
                    }
                ]
            };
            var oTheme = {color: ['#B7ADAD']};
            
        }
        else
        {
           var adata = aData;
            var option = {
                height: 200,
                tooltip: {
                    trigger: 'item',
                    formatter: " {b}: {d}%"
                },
                myLegend: {
                    scope: aPieId[0],
                    width: "48%",
                    height: 150,
                    right: "9%",
                    top: topChange(100, 31,adata.length,8),
                },
                calculable: false,
                series: [
                    {
                        //  name: aID[2],
                        type: 'pie',
                        radius: ['35%', '65%'],
                        center: ['25%', '47%'],
                        itemStyle: {
                            normal: {
                                labelLine: {
                                    show: false
                                },
                                label: {
                                    position:"inner",
                                    formatter: function(a){
                                        return"";
                                    }
                                }
                            }
                        },
                        data: adata
                    }
                ],
            }; 
            var oTheme = { 
                  color : ['#53B9E7','#CC324B','#69C4C5','#FFBB33','#FF8800','#D7DDE4']
            }; 
        }  
        $(aPieId[1]).echart("init", option, oTheme);
    }
    /*来访次数和上线次数折线图*/
    function drowUserCount_chart(aData,ID)
    {
        var adata = aData;
        var option = { 
            height: 200, 
            tooltip: {
                show: true,
                trigger: 'axis',
                axisPointer: {
                    type: 'line',
                    lineStyle: {
                        color: '#373737',
                        width: 1,
                        type: 'solid'
                    }
                }
            },
           /*legend: {
                data:['次数']
            },*/
           // dataZoom:dataZoom,
            grid: {
                x: 60,
                y: 20,
                x2: 30,
                y2: 25, //45
                borderColor: '#415172',
              // backgroundColor:"#D7DDE4"
            },
            calculable: false,
            xAxis: [
                {
                    type: 'category',
                    boundaryGap: false,
                    splitLine:{
                            show:true,
                            lineStyle :{color: '#F5F5F5', width: 1}
                        },
                     name: getRcText("TIME"), //"时间",
                    nameTextStyle: {color: "gray"},
                    axisLabel: {
                       // rotate: 45, //横轴的倾斜程度
                        show: true,
                        textStyle: {color: '#000', width: 2}
                    },
                    axisLine: {
                        show: true,
                        lineStyle: {color: '#F5F5F5', width: 1}
                    },
                    axisTick: {
                        show: false
                    },
                    data: adata[0],
                }
            ],

            yAxis: [
                {
                    type: 'value',
                    name:getRcText("MANNUM"),//"人数",
                    nameTextStyle: {color: "gray"},
                    splitLine:{
                            show:true,
                            lineStyle :{color: '#F5F5F5', width: 1}
                        },
                    axisLabel: {
                        show: true,
                        //textStyle: {color: '#47495d', width: 2}
                        textStyle: {color: '#000', width: 2}
                    },
                    axisLine: {
                        show: true,
                        lineStyle: {color: '#F5F5F5', width: 1}
                    }  
                }
            ],
            series: [
                
                {
                    symbol: "none",
                    type: 'line',
                    smooth: true,
                    itemStyle: {normal: {areaStyle: {type: 'default'}}},
                    name: getRcText("USERNUM"), //"用户数",
                    data: adata[1]
                } 
            ]

        };
        var oTheme = {
             color : ['#53B9E7','#31ADB4','#69C4C5','#FFBB33','#FF8800','#CC324B','#E64C65','#D7DDE4'],
            valueAxis: {
                splitLine: {lineStyle: {color: ['#415172']}},
                axisLabel: {textStyle: {color: ['#abbbde']}}
            },
            categoryAxis: {
                splitLine: {lineStyle: {color: ['#415172']}}
            }
        } 
        $(ID).echart("init", option, oTheme); 
    }
    /*来访次数和上线次数饼图*/ 
    function drowUserCountPie(aData,aPieId)
    {
         if(aData[0].value == 0 && aData[1].value == 0 && aData[2].value == 0 && aData[3].value == 0 && aData[4].value == 0)
        {
            var option = {
                calculable : false,
                height:150,
                tooltip : {
                    show:false
                },
                series : [
                    {
                        type: 'pie',
                        radius: ['40%', '80%'],
                        center: ['40%', '47%'],
                        itemStyle: {
                            normal: {
                                labelLine:{
                                    show:false
                                },
                                label:
                                {
                                    show:false
                                }
                            }
                        },
                        data: [{name:"",value:1}]
                    }
                ]
            };
            var oTheme = {color: ['#B7ADAD']}; 
        }
        else
        {
            var adata = aData;
            var oTheme = {
               color : ['#53B9E7','#CC324B','#69C4C5','#FFBB33','#FF8800','#D7DDE4']
            };
            var option = {
                height: 150,
                tooltip: {
                    trigger: 'item',
                    formatter: " {b}: {d}%"
                },
                myLegend: {
                    scope: aPieId[0],
                    width: "30%",
                    height: 150,
                    right: "20%",
                    top: topChange(70, 31,adata.length,5),
                },
                calculable: false,
                series: [
                    {
                        //  name: aID[2],
                        type: 'pie',
                        radius: ['40%', '80%'],
                        center: ['25%', '47%'],
                        itemStyle: { 
                            normal: {
                                labelLine: {
                                    show: false
                                },
                                label: {
                                    position:"inner",
                                    formatter: function(a){
                                        return"";
                                    }
                                }
                            }
                        },
                        data: adata
                    }
                ],
            };  
        }
       
        $(aPieId[1]).echart("init", option, oTheme); 
    }
    
   /* function UserTrailMap()
    {
        var oplace = {"六安市":[116.3123,31.8329],"安庆市":[116.7517,30.5255],"滁州市":[118.1909,32.536],"宣城市":[118.8062,30.6244],"阜阳市":[115.7629,32.9919],"宿州市":[117.5208,33.6841],"黄山市":[118.0481,29.9542],"巢湖市":[117.7734,31.4978],"亳州市":[116.1914,33.4698],"池州市":[117.3889,30.2014],"合肥市":[117.29,32.0581],"蚌埠市":[117.4109,33.1073],"芜湖市":[118.3557,31.0858],"淮北市":[116.6968,33.6896],"淮南市":[116.7847,32.7722],"马鞍山市":[118.6304,31.5363],"铜陵市":[117.9382,30.9375],"澳门":[113.5715,22.1583],"密云县":[117.0923,40.5121],"怀柔区":[116.6377,40.6219],"房山区":[115.8453,39.7163],"延庆县":[116.1543,40.5286],"门头沟区":[115.8,39.9957],"昌平区":[116.1777,40.2134],"大兴区":[116.4716,39.6352],"顺义区":[116.7242,40.1619],"平谷区":[117.1706,40.2052],"通州区":[116.7297,39.8131],"朝阳区":[116.4977,39.949],"海淀区":[116.2202,40.0239],"丰台区":[116.2683,39.8309],"石景山区":[116.1887,39.9346],"西城区":[116.3631,39.9353],"东城区":[116.418,39.9367],"宣武区":[116.3603,39.8852],"崇文区":[116.4166,39.8811],"酉阳土家族苗族自治县":[108.8196,28.8666],"奉节县":[109.3909,30.9265],"巫溪县":[109.3359,31.4813],"开县":[108.4131,31.2561],"彭水苗族土家族自治县":[108.2043,29.3994],"云阳县":[108.8306,31.0089],"万州区":[108.3911,30.6958],"城口县":[108.7756,31.9098],"江津区":[106.2158,28.9874],"石柱土家族自治县":[108.2813,30.1025],"巫山县":[109.8853,31.1188],"涪陵区":[107.3364,29.6796],"丰都县":[107.8418,29.9048],"武隆县":[107.655,29.35],"南川区":[107.1716,29.1302],"秀山土家族苗族自治县":[109.0173,28.5205],"黔江区":[108.7207,29.4708],"合川区":[106.3257,30.108],"綦江县":[106.6553,28.8171],"忠县":[107.8967,30.3223],"梁平县":[107.7429,30.6519],"巴南区":[106.7322,29.4214],"潼南县":[105.7764,30.1135],"永川区":[105.8643,29.2566],"垫江县":[107.4573,30.2454],"渝北区":[106.7212,29.8499],"长寿区":[107.1606,29.9762],"大足县":[105.7544,29.6136],"铜梁县":[106.0291,29.8059],"荣昌县":[105.5127,29.4708],"璧山县":[106.2048,29.5807],"北碚区":[106.5674,29.8883],"万盛区":[106.908,28.9325],"九龙坡区":[106.3586,29.4049],"沙坪坝区":[106.3696,29.6191],"南岸区":[106.6663,29.5367],"江北区":[106.8311,29.6191],"大渡口区":[106.4905,29.4214],"双桥区":[105.7874,29.4928],"渝中区":[106.5344,29.5477],"南平市":[118.136,27.2845],"三明市":[117.5317,26.3013],"龙岩市":[116.8066,25.2026],"宁德市":[119.6521,26.9824],"福州市":[119.4543,25.9222],"漳州市":[117.5757,24.3732],"泉州市":[118.3228,25.1147],"莆田市":[119.0918,25.3455],"厦门市":[118.1689,24.6478],"酒泉市":[96.2622,40.4517],"张掖市":[99.7998,38.7433],"甘南藏族自治州":[102.9199,34.6893],"武威市":[103.0188,38.1061],"陇南市":[105.304,33.5632],"庆阳市":[107.5342,36.2],"白银市":[104.8645,36.5076],"定西市":[104.5569,35.0848],"天水市":[105.6445,34.6289],"兰州市":[103.5901,36.3043],"平凉市":[107.0728,35.321],"临夏回族自治州":[103.2715,35.5737],"金昌市":[102.074,38.5126],"嘉峪关市":[98.1738,39.8035],"清远市":[112.9175,24.3292],"韶关市":[113.7964,24.7028],"湛江市":[110.3577,20.9894],"梅州市":[116.1255,24.1534],"河源市":[114.917,23.9722],"肇庆市":[112.1265,23.5822],"惠州市":[114.6204,23.1647],"茂名市":[111.0059,22.0221],"江门市":[112.6318,22.1484],"阳江市":[111.8298,22.0715],"云浮市":[111.7859,22.8516],"广州市":[113.5107,23.2196],"汕尾市":[115.5762,23.0438],"揭阳市":[116.1255,23.313],"珠海市":[113.7305,22.1155],"佛山市":[112.8955,23.1097],"潮州市":[116.7847,23.8293],"汕头市":[117.1692,23.3405],"深圳市":[114.5435,22.5439],"东莞市":[113.8953,22.901],"中山市":[113.4229,22.478],"百色市":[106.6003,23.9227],"河池市":[107.8638,24.5819],"桂林市":[110.5554,25.318],"南宁市":[108.479,23.1152],"柳州市":[109.3799,24.9774],"崇左市":[107.3364,22.4725],"来宾市":[109.7095,23.8403],"玉林市":[110.2148,22.3792],"梧州市":[110.9949,23.5052],"贺州市":[111.3135,24.4006],"钦州市":[109.0283,22.0935],"贵港市":[109.9402,23.3459],"防城港市":[108.0505,21.9287],"北海市":[109.314,21.6211],"遵义市":[106.908,28.1744],"黔东南苗族侗族自治州":[108.4241,26.4166],"毕节地区":[105.1611,27.0648],"黔南布依族苗族自治州":[107.2485,25.8398],"铜仁地区":[108.6218,28.0096],"黔西南布依族苗族自治州":[105.5347,25.3949],"六盘水市":[104.7546,26.0925],"安顺市":[105.9082,25.9882],"贵阳市":[106.6992,26.7682],"儋州市":[109.3291,19.5653],"文昌市":[110.8905,19.7823],"乐东黎族自治县":[109.0283,18.6301],"三亚市":[109.3716,18.3698],"琼中黎族苗族自治县":[109.8413,19.0736],"东方市":[108.8498,19.0414],"海口市":[110.3893,19.8516],"万宁市":[110.3137,18.8388],"澄迈县":[109.9937,19.7314],"白沙黎族自治县":[109.3703,19.211],"琼海市":[110.4208,19.224],"昌江黎族自治县":[109.0407,19.2137],"临高县":[109.6957,19.8063],"陵水黎族自治县":[109.9924,18.5415],"屯昌县":[110.0377,19.362],"定安县":[110.3384,19.4698],"保亭黎族苗族自治县":[109.6284,18.6108],"五指山市":[109.5282,18.8299],"承德市":[117.5757,41.4075],"张家口市":[115.1477,40.8527],"保定市":[115.0488,39.0948],"唐山市":[118.4766,39.6826],"沧州市":[116.8286,38.2104],"石家庄市":[114.4995,38.1006],"邢台市":[114.8071,37.2821],"邯郸市":[114.4775,36.535],"秦皇岛市":[119.2126,40.0232],"衡水市":[115.8838,37.7161],"廊坊市":[116.521,39.0509],"南阳市":[112.4011,33.0359],"信阳市":[114.8291,32.0197],"洛阳市":[112.0605,34.3158],"驻马店市":[114.1589,32.9041],"周口市":[114.873,33.6951],"商丘市":[115.741,34.2828],"三门峡市":[110.8301,34.3158],"新乡市":[114.2029,35.3595],"平顶山市":[112.9724,33.739],"郑州市":[113.4668,34.6234],"安阳市":[114.5325,36.0022],"开封市":[114.5764,34.6124],"焦作市":[112.8406,35.1508],"许昌市":[113.6975,34.0466],"濮阳市":[115.1917,35.799],"漯河市":[113.8733,33.6951],"鹤壁市":[114.3787,35.744],"黑河市":[127.1448,49.2957],"大兴安岭地区":[124.1016,52.2345],"哈尔滨市":[127.9688,45.368],"齐齐哈尔市":[124.541,47.5818],"牡丹江市":[129.7815,44.7089],"绥化市":[126.7163,46.8018],"伊春市":[129.1992,47.9608],"佳木斯市":[133.0005,47.5763],"鸡西市":[132.7917,45.7361],"双鸭山市":[133.5938,46.7523],"大庆市":[124.7717,46.4282],"鹤岗市":[130.4407,47.7081],"七台河市":[131.2756,45.9558],"恩施土家族苗族自治州":[109.5007,30.2563],"十堰市":[110.5115,32.3877],"宜昌市":[111.1707,30.7617],"襄樊市":[111.9397,31.9263],"黄冈市":[115.2686,30.6628],"荆州市":[113.291,30.0092],"荆门市":[112.6758,30.9979],"咸宁市":[114.2578,29.6631],"随州市":[113.4338,31.8768],"孝感市":[113.9502,31.1188],"武汉市":[114.3896,30.6628],"黄石市":[115.0159,29.9213],"神农架林区":[110.4565,31.5802],"天门市":[113.0273,30.6409],"仙桃市":[113.3789,30.3003],"潜江市":[112.7637,30.3607],"鄂州市":[114.7302,30.4102],"怀化市":[109.9512,27.4438],"永州市":[111.709,25.752],"邵阳市":[110.9619,26.8121],"郴州市":[113.2361,25.8673],"常德市":[111.4014,29.2676],"湘西土家族苗族自治州":[109.7864,28.6743],"衡阳市":[112.4121,26.7902],"岳阳市":[113.2361,29.1357],"益阳市":[111.731,28.3832],"长沙市":[113.0823,28.2568],"株洲市":[113.5327,27.0319],"张家界市":[110.5115,29.328],"娄底市":[111.6431,27.7185],"湘潭市":[112.5439,27.7075],"延边朝鲜族自治州":[129.397,43.2587],"吉林市":[126.8372,43.6047],"白城市":[123.0029,45.2637],"松原市":[124.0906,44.7198],"长春市":[125.8154,44.2584],"白山市":[127.2217,42.0941],"通化市":[125.9583,41.8579],"四平市":[124.541,43.4894],"辽源市":[125.343,42.7643],"盐城市":[120.2234,33.5577],"徐州市":[117.5208,34.3268],"南通市":[121.1023,32.1625],"淮安市":[118.927,33.4039],"苏州市":[120.6519,31.3989],"宿迁市":[118.5535,33.7775],"连云港市":[119.1248,34.552],"扬州市":[119.4653,32.8162],"南京市":[118.8062,31.9208],"泰州市":[120.0586,32.5525],"无锡市":[120.3442,31.5527],"常州市":[119.4543,31.5582],"镇江市":[119.4763,31.9702],"赣州市":[115.2795,25.8124],"吉安市":[114.884,26.9659],"上饶市":[117.8613,28.7292],"九江市":[115.4224,29.3774],"抚州市":[116.4441,27.4933],"宜春市":[115.0159,28.3228],"南昌市":[116.0046,28.6633],"景德镇市":[117.334,29.3225],"萍乡市":[113.9282,27.4823],"鹰潭市":[117.0813,28.2349],"新余市":[114.95,27.8174],"大连市":[122.2229,39.4409],"朝阳市":[120.0696,41.4899],"丹东市":[124.541,40.4242],"铁岭市":[124.2773,42.7423],"沈阳市":[123.1238,42.1216],"抚顺市":[124.585,41.8579],"葫芦岛市":[120.1575,40.578],"阜新市":[122.0032,42.2699],"锦州市":[121.6626,41.4294],"鞍山市":[123.0798,40.6055],"本溪市":[124.1455,41.1987],"营口市":[122.4316,40.4297],"辽阳市":[123.4094,41.1383],"盘锦市":[121.9482,41.0449],"呼伦贝尔市":[120.8057,50.2185],"阿拉善盟":[102.019,40.1001],"锡林郭勒盟":[115.6421,44.176],"鄂尔多斯市":[108.9734,39.2487],"赤峰市":[118.6743,43.2642],"巴彦淖尔市":[107.5562,41.3196],"通辽市":[121.4758,43.9673],"乌兰察布市":[112.5769,41.77],"兴安盟":[121.3879,46.1426],"包头市":[110.3467,41.4899],"呼和浩特市":[111.4124,40.4901],"乌海市":[106.886,39.4739],"吴忠市":[106.853,37.3755],"中卫市":[105.4028,36.9525],"固原市":[106.1389,35.9363],"银川市":[106.3586,38.1775],"石嘴山市":[106.4795,39.0015],"海西蒙古族藏族自治州":[94.9768,37.1118],"玉树藏族自治州":[93.5925,33.9368],"果洛藏族自治州":[99.3823,34.0466],"海南藏族自治州":[100.3711,35.9418],"海北藏族自治州":[100.3711,37.9138],"黄南藏族自治州":[101.5686,35.1178],"海东地区":[102.3706,36.2988],"西宁市":[101.4038,36.8207],"烟台市":[120.7397,37.5128],"临沂市":[118.3118,35.2936],"潍坊市":[119.0918,36.524],"青岛市":[120.4651,36.3373],"菏泽市":[115.6201,35.2057],"济宁市":[116.8286,35.3375],"德州市":[116.6858,37.2107],"滨州市":[117.8174,37.4963],"聊城市":[115.9167,36.4032],"东营市":[118.7073,37.5513],"济南市":[117.1582,36.8701],"泰安市":[117.0264,36.0516],"威海市":[121.9482,37.1393],"日照市":[119.2786,35.5023],"淄博市":[118.0371,36.6064],"枣庄市":[117.323,34.8926],"莱芜市":[117.6526,36.2714],"榆林市":[109.8743,38.205],"延安市":[109.1052,36.4252],"汉中市":[106.886,33.0139],"安康市":[109.1162,32.7722],"商洛市":[109.8083,33.761],"宝鸡市":[107.1826,34.3433],"渭南市":[109.7864,35.0299],"咸阳市":[108.4131,34.8706],"西安市":[109.1162,34.2004],"铜川市":[109.0393,35.1947],"忻州市":[112.4561,38.8971],"吕梁市":[111.3574,37.7325],"临汾市":[111.4783,36.1615],"晋中市":[112.7747,37.37],"运城市":[111.1487,35.2002],"大同市":[113.7854,39.8035],"长治市":[112.8625,36.4746],"朔州市":[113.0713,39.6991],"晋城市":[112.7856,35.6342],"太原市":[112.3352,37.9413],"阳泉市":[113.4778,38.0951],"崇明县":[121.5637,31.5383],"南汇区":[121.8755,30.954],"奉贤区":[121.5747,30.8475],"浦东新区":[121.6928,31.2561],"金山区":[121.2657,30.8112],"青浦区":[121.1751,31.1909],"松江区":[121.1984,31.0268],"嘉定区":[121.2437,31.3625],"宝山区":[121.4346,31.4051],"闵行区":[121.4992,31.0838],"杨浦区":[121.528,31.2966],"普陀区":[121.3879,31.2602],"徐汇区":[121.4333,31.1607],"长宁区":[121.3852,31.2115],"闸北区":[121.4511,31.2794],"虹口区":[121.4882,31.2788],"黄浦区":[121.4868,31.219],"卢湾区":[121.4758,31.2074],"静安区":[121.4484,31.2286],"甘孜藏族自治州":[99.9207,31.0803],"阿坝藏族羌族自治州":[102.4805,32.4536],"凉山彝族自治州":[101.9641,27.6746],"绵阳市":[104.7327,31.8713],"达州市":[107.6111,31.333],"广元市":[105.6885,32.2284],"雅安市":[102.6672,29.8938],"宜宾市":[104.6558,28.548],"乐山市":[103.5791,29.1742],"南充市":[106.2048,31.1517],"巴中市":[107.0618,31.9977],"泸州市":[105.4578,28.493],"成都市":[103.9526,30.7617],"资阳市":[104.9744,30.1575],"攀枝花市":[101.6895,26.7133],"眉山市":[103.8098,30.0146],"广安市":[106.6333,30.4376],"德阳市":[104.48,31.1133],"内江市":[104.8535,29.6136],"遂宁市":[105.5347,30.6683],"自贡市":[104.6667,29.2786],"台湾":[121.0295,23.6082],"蓟县":[117.4672,40.004],"武清区":[117.0621,39.4121],"宝坻区":[117.4274,39.5913],"静海县":[116.9824,38.8312],"宁河县":[117.6801,39.3853],"大港区":[117.3875,38.757],"塘沽区":[117.6801,38.9987],"西青区":[117.1829,39.0022],"北辰区":[117.1761,39.2548],"东丽区":[117.4013,39.1223],"汉沽区":[117.8888,39.2191],"津南区":[117.3958,38.9603],"河西区":[117.2365,39.0804],"河东区":[117.2571,39.1209],"南开区":[117.1527,39.1065],"河北区":[117.2145,39.1615],"红桥区":[117.1596,39.1663],"和平区":[117.2008,39.1189],"那曲地区":[88.1982,33.3215],"阿里地区":[82.3645,32.7667],"日喀则地区":[86.2427,29.5093],"林芝地区":[95.4602,29.1138],"昌都地区":[97.0203,30.7068],"山南地区":[92.2083,28.3392],"拉萨市":[91.1865,30.1465],"香港":[114.2784,22.3057],"巴音郭楞蒙古自治州":[88.1653,39.6002],"和田地区":[81.167,36.9855],"哈密地区":[93.7793,42.9236],"阿克苏地区":[82.9797,41.0229],"阿勒泰地区":[88.2971,47.0929],"喀什地区":[77.168,37.8534],"塔城地区":[86.6272,45.8514],"昌吉回族自治州":[89.6814,44.4507],"克孜勒苏柯尔克孜自治州":[74.6301,39.5233],"吐鲁番地区":[89.6375,42.4127],"伊犁哈萨克自治州":[82.5513,43.5498],"博尔塔拉蒙古自治州":[81.8481,44.6979],"乌鲁木齐市":[87.9236,43.5883],"克拉玛依市":[85.2869,45.5054],"阿拉尔市":[81.2769,40.6549],"图木舒克市":[79.1345,39.8749],"五家渠市":[87.5391,44.3024],"石河子市":[86.0229,44.2914],"普洱市":[100.7446,23.4229],"红河哈尼族彝族自治州":[103.0408,23.6041],"文山壮族苗族自治州":[104.8865,23.5712],"曲靖市":[103.9417,25.7025],"楚雄彝族自治州":[101.6016,25.3619],"大理白族自治州":[99.9536,25.6805],"临沧市":[99.613,24.0546],"迪庆藏族自治州":[99.4592,27.9327],"昭通市":[104.0955,27.6031],"昆明市":[102.9199,25.4663],"丽江市":[100.448,26.955],"西双版纳傣族自治州":[100.8984,21.8628],"保山市":[99.0637,24.9884],"玉溪市":[101.9312,23.8898],"怒江傈僳族自治州":[99.1516,26.5594],"德宏傣族景颇族自治州":[98.1299,24.5874],"丽水市":[119.5642,28.1854],"杭州市":[119.5313,29.8773],"温州市":[120.498,27.8119],"宁波市":[121.5967,29.6466],"舟山市":[122.2559,30.2234],"台州市":[121.1353,28.6688],"金华市":[120.0037,29.1028],"衢州市":[118.6853,28.8666],"绍兴市":[120.564,29.7565],"嘉兴市":[120.9155,30.6354],"湖州市":[119.8608,30.7782]};
       
        var  acDate = [{"name": "朝阳区", "geoCoord": [116.4977, 39.949], "value": 1}, {
                "name": "杭州市", "geoCoord": [119.5313, 29.8773], "value": 13
            }, {"name": "西城区", "geoCoord": [116.3631, 39.9353], "value": 1}, {
                "name": "海淀区", "geoCoord": [116.2202, 40.0239], "value": 4
            }, {"name": "昌平区", "geoCoord": [116.1777, 40.2134], "value": 3}, {
                "name": "东城区", "geoCoord": [116.418, 39.9367], "value": 1
            }, {
                "name": "宣城市", "geoCoord": [118.8062, 30.6244], "value": 1
            }, {"name": "滁州市", "geoCoord": [118.1909, 32.536], "value": 1}, {
                "name": "大兴区", "geoCoord": [116.4716, 39.6352], "value": 1
            }, {
                "name": "三亚市", "geoCoord": [109.3716, 18.3698], "value": 1
            }, {"name": "乌鲁木齐市", "geoCoord": [87.9236, 43.5883], "value": 1}, {
                "name": "绍兴市", "geoCoord": [120.564, 29.7565], "value": 1
            }, {"name": "成都市", "geoCoord": [103.9526, 30.7617], "value": 1}, {
                "name": "西宁市",
                "geoCoord": [101.4038, 36.8207],
                "value": 1
            },
                {"name": "渝中区", "geoCoord": [106.5344, 29.5477], "value": 1}, {
                    "name": "榆林市",
                    "geoCoord": [109.8743, 38.205],
                    "value": 1
                }, {"name": "郑州市", "geoCoord": [113.4668, 34.6234], "value": 1},
                {"name": "石家庄市", "geoCoord": [114.4995, 38.1006], "value": 1}, {
                    "name": "太原市",
                    "geoCoord": [112.3352, 37.9413],
                    "value": 3
                }, {"name": "济南市", "geoCoord": [117.1582, 36.8701], "value": 3}, {
                    "name": "长沙市",
                    "geoCoord": [113.0823, 28.2568],
                    "value": 5
                }];
             var  adata = [
                    [{name:'北京'}, {name:'上海',value:95}],
                    [{name:'北京'}, {name:'广州',value:90}],
                    [{name:'北京'}, {name:'大连',value:80}],
                    [{name:'石家庄'}, {name:'南宁',value:70}],
                    [{name:'石家庄'}, {name:'南昌',value:60}],
                    [{name:'石家庄'}, {name:'拉萨',value:50}],
                    [{name:'南京'}, {name:'长春',value:40}],
                    [{name:'南京'}, {name:'包头',value:30}],
                    [{name:'南京'}, {name:'重庆',value:20}],
                    [{name:'上海'}, {name:'常州',value:10}],
                    [{name:'上海'}, {name:'济南',value:95}],
                    [{name:'上海'}, {name:'临汾',value:90}],
                    [{name:'上海'}, {name:'长治',value:80}], 
                    [{name:'大同'}, {name:'合肥',value:60}],
                    [{name:'重庆'}, {name:'西宁',value:50}],
                    [{name:'重庆'}, {name:'兰州',value:40}],
                    [{name:'重庆'}, {name:'包头',value:30}],
                   
                    [{name:'佛山'}, {name:'北海',value:50}],
                    [{name:'佛山'}, {name:'南宁',value:40}],
                    [{name:'拉萨'}, {name:'南昌',value:30}],
                    [{name:'拉萨'}, {name:'南通',value:20}],
                    [{name:'长春'}, {name:'厦门',value:10}],
                     [{name:'长春'}, {name:'台州',value:50}],
                    [{name:'长春'}, {name:'合肥',value:40}],
                    [{name:'银川'}, {name:'咸阳',value:30}],
                    [{name:'银川'}, {name:'哈尔滨',value:20}],
                    [{name:'银川'}, {name:'唐山',value:10}],
                     [{name:'东莞'}, {name:'唐山',value:50}],
                    [{name:'东莞'}, {name:'嘉兴',value:40}], 
                     [{name:'太原'}, {name:'拉萨',value:50}],
                    [{name:'太原'}, {name:'长春',value:40}],
                    [{name:'大连'}, {name:'包头',value:30}],
                    [{name:'大连'}, {name:'重庆',value:20}],
                    [{name:'西安'}, {name:'大连',value:10}], 
                ]
        var option = {
            height:550,
            // backgroundColor: '#1b1b1b',
            color: [
                    'rgba(9, 209, 255, 0.57)',
                    'rgba(85, 85, 255, 0.57)'
                    ],
           /* title : {
                text: '用户轨迹',
                x:'center',
                textStyle : {
                    color: 'rgba(52, 62,78, 0.57)',
                    fontSize: 24
                }
            }, */
             /* series :[
              {
                name: '',
                type: 'map',
                mapType: 'china',
                itemStyle: {
                    normal: {
                        borderColor: 'rgba(100,149,237,0.2)',//rgba(220,220,223,1)',
                        borderWidth: 0.5,
                        areaStyle: {
                            color: 'rgba(245,245,245,1)'
                        }
                    },
                    emphasis: {
                        label: {show: true},
                        areaStyle: {
                            color: '#1b1b1b'//'rgba(120,206,195,0.3)'
                        }
                    }
                },
                hoverable: false,
                roam: false,
                data: [],

                 geoCoord: {
                '上海': [121.4648,31.2891],
                '东莞': [113.8953,22.901],
                '东营': [118.7073,37.5513],
                '中山': [113.4229,22.478],
                '临汾': [111.4783,36.1615],
                '临沂': [118.3118,35.2936],
                '丹东': [124.541,40.4242],
                '丽水': [119.5642,28.1854],
                '乌鲁木齐': [87.9236,43.5883],
                '佛山': [112.8955,23.1097],
                '保定': [115.0488,39.0948],
                '兰州': [103.5901,36.3043],
                '包头': [110.3467,41.4899],
                '北京': [116.4551,40.2539],
                '北海': [109.314,21.6211],
                '南京': [118.8062,31.9208],
                '南宁': [108.479,23.1152],
                '南昌': [116.0046,28.6633],
                '南通': [121.1023,32.1625],
                '厦门': [118.1689,24.6478],
                '台州': [121.1353,28.6688],
                '合肥': [117.29,32.0581],
                '呼和浩特': [111.4124,40.4901],
                '咸阳': [108.4131,34.8706],
                '哈尔滨': [127.9688,45.368],
                '唐山': [118.4766,39.6826],
                '嘉兴': [120.9155,30.6354],
                '大同': [113.7854,39.8035],
                '大连': [122.2229,39.4409],
                '天津': [117.4219,39.4189],
                '太原': [112.3352,37.9413],
                '威海': [121.9482,37.1393],
                '宁波': [121.5967,29.6466],
                '宝鸡': [107.1826,34.3433],
                '宿迁': [118.5535,33.7775],
                '常州': [119.4543,31.5582],
                '广州': [113.5107,23.2196],
                '廊坊': [116.521,39.0509],
                '延安': [109.1052,36.4252],
                '张家口': [115.1477,40.8527],
                '徐州': [117.5208,34.3268],
                '德州': [116.6858,37.2107],
                '惠州': [114.6204,23.1647],
                '成都': [103.9526,30.7617],
                '扬州': [119.4653,32.8162],
                '承德': [117.5757,41.4075],
                '拉萨': [91.1865,30.1465],
                '无锡': [120.3442,31.5527],
                '日照': [119.2786,35.5023],
                '昆明': [102.9199,25.4663],
                '杭州': [119.5313,29.8773],
                '枣庄': [117.323,34.8926],
                '柳州': [109.3799,24.9774],
                '株洲': [113.5327,27.0319],
                '武汉': [114.3896,30.6628],
                '汕头': [117.1692,23.3405],
                '江门': [112.6318,22.1484],
                '沈阳': [123.1238,42.1216],
                '沧州': [116.8286,38.2104],
                '河源': [114.917,23.9722],
                '泉州': [118.3228,25.1147],
                '泰安': [117.0264,36.0516],
                '泰州': [120.0586,32.5525],
                '济南': [117.1582,36.8701],
                '济宁': [116.8286,35.3375],
                '海口': [110.3893,19.8516],
                '淄博': [118.0371,36.6064],
                '淮安': [118.927,33.4039],
                '深圳': [114.5435,22.5439],
                '清远': [112.9175,24.3292],
                '温州': [120.498,27.8119],
                '渭南': [109.7864,35.0299],
                '湖州': [119.8608,30.7782],
                '湘潭': [112.5439,27.7075],
                '滨州': [117.8174,37.4963],
                '潍坊': [119.0918,36.524],
                '烟台': [120.7397,37.5128],
                '玉溪': [101.9312,23.8898],
                '珠海': [113.7305,22.1155],
                '盐城': [120.2234,33.5577],
                '盘锦': [121.9482,41.0449],
                '石家庄': [114.4995,38.1006],
                '福州': [119.4543,25.9222],
                '秦皇岛': [119.2126,40.0232],
                '绍兴': [120.564,29.7565],
                '聊城': [115.9167,36.4032],
                '肇庆': [112.1265,23.5822],
                '舟山': [122.2559,30.2234],
                '苏州': [120.6519,31.3989],
                '莱芜': [117.6526,36.2714],
                '菏泽': [115.6201,35.2057],
                '营口': [122.4316,40.4297],
                '葫芦岛': [120.1575,40.578],
                '衡水': [115.8838,37.7161],
                '衢州': [118.6853,28.8666],
                '西宁': [101.4038,36.8207],
                '西安': [109.1162,34.2004],
                '贵阳': [106.6992,26.7682],
                '连云港': [119.1248,34.552],
                '邢台': [114.8071,37.2821],
                '邯郸': [114.4775,36.535],
                '郑州': [113.4668,34.6234],
                '鄂尔多斯': [108.9734,39.2487],
                '重庆': [107.7539,30.1904],
                '金华': [120.0037,29.1028],
                '铜川': [109.0393,35.1947],
                '银川': [106.3586,38.1775],
                '镇江': [119.4763,31.9702],
                '长春': [125.8154,44.2584],
                '长沙': [113.0823,28.2568],
                '长治': [112.8625,36.4746],
                '阳泉': [113.4778,38.0951],
                '青岛': [120.4651,36.3373],
                '韶关': [113.7964,24.7028]
            },
              markLine: {

                    effect: {
                        color:  'rgba(204, 246, 255, 0.09)',//'rgba(204, 246, 255, 0.09)',
                        show: true,
                        period: 40
                    },
                    bundling: {
                        enable: true
                    },
                    large: true,
                    smooth: true,
                    smoothness: 0.1,
                    symbol: ['none', 'none'], 
                     itemStyle : {
                        normal: {
                            borderWidth:1,
                            lineStyle: { 
                                 //color: 'rgba(2, 166, 253, 0.05)',
                                type: 'solid',
                                shadowBlur: 10,
                                width: 0.5,
                                opacity: 0.2
                            }
                    }
                },
                     data : adata 
                },
                 markPoint: {
                    symbol: 'circle',
                    symbolSize: 1.5,
                    itemStyle: {
                        normal: {
                            color: 'rgba(255, 0, 0, 0.5)'
                        }   
                    },
                    data: acDate
                } 
            }],
        };

        var oTheme={};
        g_MyChart = $("#Usertrail").echart("init", option,oTheme);
        g_MyChart.setOption(option, false);  
    }*/

    /*上网信息数据折线图请求*/
    function AjaxDpiChart(StartTime,EndTime)
    {
        var sNowStart = getTheDate("one", "start");
        var sNowEndTime = getTheDate("one", "end");
        var sStartTime = StartTime || sNowStart;
        var sEnd = EndTime || sNowEndTime;
        var nStartTime = sStartTime / 1000;
        var nEndTime = sEnd / 1000;
        var nHour = new Date().getHours();  
        /*发送Ajax获取用户上网数量趋势的数据*/
         /*将所有的用户MAC地址放到数组中下发*/
        /*var aMacaddr = [];
        for(var i=0;i<g_UserMsg.length;i++)
        {
             Array.prototype.push.apply(aMacaddr,g_UserMsg[i].macAddr);
        }*/
        var aUserId = [];
        for(var i=0;i<g_UserMsg.length;i++)
        {
          aUserId.push(g_UserMsg[i].userId);
             //Array.prototype.push.apply(aUserId,g_UserMsg[i].macAddr);
        }
        if(aUserId.length == 0)
        {
            aUserId.push("000");
        }
        /*需要下发的消息*/
         var SendMsg = {
            GetUrlPersonNumChart:{
                url: MyConfig.path + "/ant/read_dpi_url",
                dataType: "json",
                type: "post",
                data: {
                    Method: 'GetUrlPersonNumChart',
                    SelectPage:'dashboard',
                    Time: nHour,
                    Param: {
                        family: "0",
                        direct: "0",
                        ACSNList: g_sn,
                        //MACList:aMacaddr,
                        //UserList:aUserId,
                        StartTime: nStartTime,
                        EndTime: nEndTime,
                    }
                },
                onSuccess:getUrlMsgSuccess,
                onFailed:getUrlMsgFail 
            },
            GetAppPersonNumChart:{
                url: MyConfig.path + "/ant/read_dpi_app",
                dataType: "json",
                type: "post", 
                data: {
                    Method: 'GetAppPersonNumChart',
                    SelectPage:'dashboard', 
                    Time: nHour,
                    Param: {
                        family: "0",
                        direct: "0",
                        ACSNList: g_sn,//["210235A1SQC15A000045","210235A1SQC15A000045"],//g_sn,
                        //MACList:aMacaddr,
                        //UserList:aUserId,
                        StartTime: nStartTime,
                        EndTime: nEndTime,
                    }
                },
                onSuccess:getAppMsgSuccess,
                onFailed:getAppMsgFail
            }
        }
        Utils.Request.sendRequest(SendMsg.GetUrlPersonNumChart);
        Utils.Request.sendRequest(SendMsg.GetAppPersonNumChart); 
         function getUrlMsgSuccess(data)
         { 
            var aMessage = data.message;
            var aGroup = aMessage.aGroupDate;
            var aData = aMessage.aData;
            var aTime = aMessage.aTime;
            var aSeriesData = [];

           /*测试数据*/
            /*var aUrldata = [14,51,33,33,26,13,77,25,42,24,23];
            var aUrldata1 = [21,11,43,13,86,63,77,35,22,94,23];
            var aUrldata2 = [24,31,53,53,56,33,57,55,12,14,73];
            var aUrldata3 = [24,71,53,23,66,13,97,15,92,84,63];
            var aTime =    ["0:00","1:00","2:00","3:00","4:00","5:00","6:00","7:00","8:00","9:00","10:00"];
            var aData = [aUrldata,aUrldata1,aUrldata2,aUrldata3];
            var aGroup = [{APPGroupName:"下载"},{APPGroupName:"通讯"},{APPGroupName:"工具"},{APPGroupName:"金融"}];
            */
            for(var i=0;i<aTime.length;i++)
            {
                var Chart_y = (EndTime-StartTime)/1000/3600/24;
                if(Chart_y <= 1)
                {
                    aTime[i] = new Date(aTime[i]);
                    aTime[i] = (aTime[i].toTimeString()).slice(0, 2)+":00";
                }
                else
                {
                    aTime[i] = new Date(aTime[i]);
                    aTime[i] = (aTime[i].toLocaleDateString()).slice(5);
                }
                
            }
            if(aData.length == 0)
            {
                for(var i=0;i<aTime.length;i++)
                {
                    aData[i] = 0;
                }
                var oTemp = {
                    symbol: "none",
                    type: 'line',
                    smooth: true,
                    itemStyle: {normal: {areaStyle: {type: 'default'}}},  
                    data: aData
                };
                aSeriesData[0] = oTemp;
            }
            else
            {
               for(var i=0;i<aGroup.length;i++)
               {
                   var oTemp = {
                        symbol: "none",
                        type: 'line',
                        smooth: true,
                        itemStyle: {normal: {areaStyle: {type: 'default'}}},
                        name: aGroup[i].CategoryName,
                        data: aData[i]
                    };
                    aSeriesData[i] = oTemp;
               } 
            }
           
            /*网站折线图*/
            var ChartId = "#UrlType_chart"
            drowLocaltionAndDpiChart(aTime,aSeriesData,ChartId);
         }
         function getAppMsgSuccess(data)
         { 
           var aMessage = data.message;
           var aGroup = aMessage.aGroupDate;
           var aData = aMessage.aData;
           var aTime = aMessage.aTime;
           var aSeriesData = [];

           /*测试数据*/
           /* var aUrldata = [14,51,33,33,26,13,77,25,42,24,23];
            var aUrldata1 = [21,11,43,13,86,63,77,35,22,94,23];
            var aUrldata2 = [24,31,53,53,56,33,57,55,12,14,73];
            var aUrldata3 = [24,71,53,23,66,13,97,15,92,84,63];
            var aTime =    ["0:00","1:00","2:00","3:00","4:00","5:00","6:00","7:00","8:00","9:00","10:00"];
            var aData = [aUrldata,aUrldata1,aUrldata2,aUrldata3];
            var aGroup = [{APPGroupName:"下载"},{APPGroupName:"通讯"},{APPGroupName:"工具"},{APPGroupName:"金融"}];
*/
            for(var i=0;i<aTime.length;i++)
            {
                var Chart_y = (EndTime-StartTime)/1000/3600/24;
                if(Chart_y <= 1)
                {
                    aTime[i] = new Date(aTime[i]);
                    aTime[i] = (aTime[i].toTimeString()).slice(0, 2)+":00";
                }
                else
                {
                    aTime[i] = new Date(aTime[i]);
                    aTime[i] = (aTime[i].toLocaleDateString()).slice(5);
                }
                
            }
            if(aData.length == 0)
            {
                for(var i=0;i<aTime.length;i++)
                {
                    aData[i] = 0;
                }
                var oTemp = {
                    symbol: "none",
                    type: 'line',
                    smooth: true,
                    itemStyle: {normal: {areaStyle: {type: 'default'}}},  
                    data: aData
                };
                aSeriesData[0] = oTemp;
            }
            else
            {
               for(var i=0;i<aGroup.length;i++)
               {
                   var oTemp = {
                        symbol: "none",
                        type: 'line',
                        smooth: true,
                        itemStyle: {normal: {areaStyle: {type: 'default'}}},
                        name: aGroup[i].APPGroupName,
                        data: aData[i]
                    };
                    aSeriesData[i] = oTemp;
               } 
            } 
            /*应用折线图*/
            var ChartId = "#AppType_chart"
            drowLocaltionAndDpiChart(aTime,aSeriesData,ChartId); 
         }
         function getUrlMsgFail()
         {
            return;
         }
         
        function getAppMsgFail()
         {
            return;
         } 
    }
    /*上网信息饼图请求*/
    function AjaxAppAndUrlPie(StartTime,EndTime)
    {

        var sNowStart = getTheDate("one", "start");
        var sNowEndTime = getTheDate("one", "end");
        var sStartTime = StartTime || sNowStart;
        var sEnd = EndTime || sNowEndTime;
        var nStartTime = sStartTime / 1000;
        var nEndTime = sEnd / 1000;
        /*将所有的用户MAC地址放到数组中下发*/
        /*var aMacaddr = [];
        for(var i=0;i<g_UserMsg.length;i++)
        {
             Array.prototype.push.apply(aMacaddr,g_UserMsg[i].macAddr);
        }*/

        var aUserId = [];
        for(var i=0;i<g_UserMsg.length;i++)
        {
            aUserId.push(g_UserMsg[i].userId);
             //Array.prototype.push.apply(aUserId,g_UserMsg[i].macAddr);
        }
        if(aUserId.length == 0)
        {
            aUserId.push("000");
        }
        /*需要下发的消息*/
         var SendMsg = {
            GetUrlType:{
                url: MyConfig.path + "/ant/read_dpi_url",
                dataType: "json",
                type: "post",
                data: {
                    Method: 'GetUrlType',
                    SelectPage:'dashboard',
                    Param: {
                        family: "0",
                        direct: "0",
                        ACSNList: g_sn,
                        //MACList:aMacaddr,
                        //UserList:aUserId,
                        StartTime: nStartTime,
                        EndTime: nEndTime,
                    }
                },
                onSuccess:getUrlMsgSuccess,
                onFailed:getUrlMsgFail
            },
            GetAppType:{
                url: MyConfig.path + "/ant/read_dpi_app",
                dataType: "json",
                type: "post",
                data: {
                    Method: 'GetAppType', 
                    SelectPage:'dashboard',
                    Param: {
                        family: "0",
                        direct: "0",
                        ACSNList:g_sn,//["210235A1SQC15A000045"/*,"210235A1SQC15A000051"*/],//g_sn,
                        //MACList:aMacaddr,
                       // UserList:aUserId,
                        StartTime: nStartTime,
                        EndTime: nEndTime,
                    }
                },
                onSuccess:getAppMsgSuccess,
                onFailed:getAppMsgFail
            }
        }
        /*发送Ajax获取应用类型的数据*/
        Utils.Request.sendRequest(SendMsg.GetAppType);
        function getAppMsgSuccess(data)
        { 
            var aData = data.message; 
            for(var i=0;i<aData.length;i++)
            {
                if(aData[i].name == "")
                {
                    aData.splice(i,1);
                    i--;
                }
            }
            /*应用信息*/

            /*测试数据*/
            //var aData = [{name:"游戏",value:12},{name:"影视音乐",value:25},{name:"新闻",value:14},{name:"工具",value:46},{name:"下载",value:23}]; 
       
            var aPieId = ["#AppType_message","#AppType_pie"];
            drowDpiAndLocaltionPie(aData,aPieId);
        }
        function getAppMsgFail()
        {
            console.log("fail terminal fail!");
        }  
        /*发送Ajax获取网站类型的数据*/
         Utils.Request.sendRequest(SendMsg.GetUrlType);
        function getUrlMsgSuccess(data)
        { 
            var aData = data.message; 
            for(var i=0;i<aData.length;i++)
            {
                if(aData[i].name == "")
                {
                    aData.splice(i,1);
                    i--;
                }
            }
           /*网站信息*/
            //var aData = [{name:"娱乐",value:12},{name:"购物",value:25},{name:"科技",value:500},{name:"搜索",value:46},{name:"下载",value:23}]; 

            var aPieId = ["#UrlType_message","#UrlType_pie"];
            drowDpiAndLocaltionPie(aData,aPieId); 
        }
        function getUrlMsgFail()
        {
            console.log("fail terminal fail!");
        } 
        
    }
    /*来访次数折线图请求*/
    function AccessUser_chart(StartTime,EndTime)
    {
        /*一天的折线图数据请求*/
        if(g_SelectTime == 0)
        {
            method = "GetUserTimeClassify";  
        }
        /*其他时间的折线图数据请求*/
        else
        {
            method = "GetUserTimeClassify";
        }
        var SendMsg = {
            url: MyConfig.path + "/read_probeclient",
            dataType: "json",
            type: "post",
            data:{
                Method : method, 
                Param  :{
                ACSNList : g_sn,//或者ACSNlist:[xxxx,xxxx,xxxx],
                StartTime : StartTime,   
                EndTime : EndTime,     
                      
                } 
            }, 
            onSuccess:MsgSuccess,
            onFailed:getMsgFail,
        };
        Utils.Request.sendRequest(SendMsg);
        function MsgSuccess(data)
        {
            var message = data.message;
            var aTime = [],aValue = [];
            for(var i=0;i<message.length;i++)
            {
                aTime.push(message[i].name);
                aValue.push(message[i].value);
            }
            var Chart_y = (EndTime-StartTime)/1000/3600/24;
            for(var i=0;i<aTime.length;i++)
            {
                if(Chart_y <= 1)
                {
                    aTime[i] = new Date(aTime[i]);
                    aTime[i] = (aTime[i].toTimeString()).slice(0, 2)+":00";
                }
                else
                {
                    aTime[i] = new Date(aTime[i]);
                    aTime[i] = (aTime[i].toLocaleDateString()).slice(5);
                } 
            }
            
            var aData = [aTime,aValue];
            var ID = "#visiteCount_Chart"
            drowUserCount_chart(aData,ID); 

        } 
        function getMsgFail()
        {
            return;
        }
        /*发送ajax请求获取来访用户趋势数据*/ 
        /*var aData = [["1:00","2:00","3:00","4:00","5:00","6:00","7:00","8:00","9:00","10:00"],[45,6,21,11,25,65,43,43,55,90]];
        var ID = "#visiteCount_Chart"
        drowUserCount_chart(aData,ID); */
    }
    /*上线次数折线图请求*/
    function UserVisite_chart(StartTime,EndTime)
    {
        var Chart_y = (EndTime-StartTime)/1000/3600/24;
        var tNow = new Date();
        var nOneHour = 3600*1000;//
        /*显示一天的数据*/
        if(Chart_y <=1)
        {
            var nHour = new Date().getHours();
            var aTime = [],aDataCount = [];
            for (var i = 0; i < nHour; i++)
            {
                aTime[i] = tNow - nOneHour * (nHour - i - 1);
                aDataCount[i] = 0;
            }
            var aUserVisitTime = [];
            for(var i=0;i<g_UserMsg.length;i++)
            {
                Array.prototype.push.apply(aUserVisitTime, g_UserMsg[i].visitTime);
            }
            for(var i=0;i<aTime.length;i++)
            {
                for(var j=0;j<aUserVisitTime.length;j++)
                {
                    var nTime = new Date(aUserVisitTime[j]).getTime();
                    if(nTime>=aTime[i] && nTime<aTime[i+1])
                    {
                       aDataCount[i]++; 
                    }
                }
                aTime[i] = new Date(aTime[i]);
                aTime[i] = (aTime[i].toTimeString()).slice(0, 2)+":00";
            } 
            var aData = [];
            aData.push(aTime,aDataCount);
            var ID = "#AccessUser_Chart"
            drowUserCount_chart(aData,ID); 
        }
        /*显示非一天的数据*/
        else
        {
            var aTime = [],aDataCount = [];
            var nOneDay= 24*3600*1000;// 
            var nyear = new Date().getFullYear();
            var nmonth = new Date().getMonth();
            var nday = new Date().getDate();
            var tNow = new Date(nyear,nmonth,nday); 
            for (var i = 0; i < Chart_y; i++)
            {
                aTime[i] = tNow - nOneDay*(Chart_y-i-1);
                aDataCount[i] = 0;
                 
            } 
            var aUserVisitTime = [];
            for(var i=0;i<g_UserMsg.length;i++)
            {
                Array.prototype.push.apply(aUserVisitTime, g_UserMsg[i].visitTime);
            }
            for(var i=0;i<aTime.length;i++)
            {
                for(var j=0;j<aUserVisitTime.length;j++)
                {
                    var nTime = new Date(aUserVisitTime[j]).getTime();
                    if(nTime>=aTime[i] && nTime<aTime[i+1])
                    {
                       aDataCount[i]++; 
                    }
                }
                aTime[i] = new Date(aTime[i]);
                aTime[i] = (aTime[i].toLocaleDateString()).slice(5);
            } 
            var aData = [];
            aData.push(aTime,aDataCount);
            var ID = "#AccessUser_Chart"
            drowUserCount_chart(aData,ID); 
            
        }
        /*var aData = [["1:00","2:00","3:00","4:00","5:00","6:00","7:00","8:00","9:00","10:00"],[66,6,21,11,25,65,43,43,55,90]];
        var ID = "#AccessUser_Chart"
        drowUserCount_chart(aData,ID); */
    }
    /*头部数据填充*/
    function initHeadMsg(StartTime,EndTime)
    {  
        /*获取总数 男 女 未知 的数据 所有关于用户身份信息的数据已放到发g_UserMsg全局变量中*/
        var manCount = 0,womanCount = 0,unknowCount = 0;
        var UserMsgLen = g_UserMsg.length;
        for(var i=0;i<UserMsgLen;i++)
        {
            if(g_UserMsg[i].sex == 0)
            {
               unknowCount++;
               continue;
            }
            if(g_UserMsg[i].sex == 1)
            {
                manCount++;
                continue;
            }
            else
            {
                womanCount++;
            }
        }
        $("#TotalUserNum").html(UserMsgLen);
        $("#manUserNum").html(manCount);
        $("#womanUserNum").html(womanCount);
        $("#UnknowSexNum").html(unknowCount);
        /*获取联网人数和未联网人数*/
         var SendMsg = {
            url: MyConfig.path + "/useridentity/getOnOffLineUserNumber",
            dataType: "json",
            type: "post",
            data:{ 
                devSNList:g_sn, 
            }, 
            onSuccess:MsgSuccess,
            onFailed:MsgFail,
        };
        Utils.Request.sendRequest(SendMsg);
        function MsgSuccess(data)
        {
             $("#NetPlayNum").html(data.onlineUserNumber);
             $("#NotNetworkNum").html(UserMsgLen - data.onlineUserNumber);
        }
        function MsgFail()
        {
            return;
        }

    }

    /*来访次数饼图数据请求*/
    function UserAccessNum(StartTime,EndTime)
    {
        /*发送Ajax请求获取来访次数*/ 
         var SendMsg = {
            url: MyConfig.path + "/read_probeclient",
            dataType: "json",
            type: "post",
            data:{
                Method : "GetUserCount", 
                Param  :{
                ACSNList : g_sn,//或者ACSNlist:[xxxx,xxxx,xxxx],
                StartTime : StartTime,   
                EndTime : EndTime,     
                      
                } 
            }, 
            onSuccess:AccessNumgetMsgSuccess,
            onFailed:AccessgetMsgFail,
        };
        Utils.Request.sendRequest(SendMsg);
        function AccessNumgetMsgSuccess(data)
        {
            var message = data.message;
            var aAccessNumToBar = [0,0,0,0,0];
            for(var i=0;i<message.length;i++) 
            {
                var Count = message[i].Count;
                var Sum = message[i].Sum;
                switch(Count)
                {
                    case 1:
                    {
                        aAccessNumToBar[0] = Sum;
                        break;
                    }
                    case 2:
                    {
                        aAccessNumToBar[1] = Sum;
                        break;
                    }
                    case 3:
                    {
                        aAccessNumToBar[2] = Sum;
                        break;
                    }
                    case 4:
                    {
                        aAccessNumToBar[3] = Sum;
                        break;
                    }
                    default:
                    {
                        aAccessNumToBar[4] += Sum;
                    }
                }
            }
            var adata = [{name:"1次",value:aAccessNumToBar[0]},{name:"2次",value:aAccessNumToBar[1]},{name:"3次",value:aAccessNumToBar[2]},{name:"4次",value:aAccessNumToBar[3]},{name:">=5次",value:aAccessNumToBar[4]}];
            var aPieId = ["#UserAccessNum_message","#UserAccessNum_pie"];
            drowUserCountPie(adata,aPieId);
            $("#onetime").html(aAccessNumToBar[0]+"人");
            $("#twotime").html(aAccessNumToBar[1]+"人");
            $("#thretime").html(aAccessNumToBar[2]+"人");
            $("#fourtime").html(aAccessNumToBar[3]+"人");
            $("#fivetime").html(aAccessNumToBar[4]+"人");
            
        }
        function AccessgetMsgFail()
        {
             return;
        }

        /*var aAccessNumToBar = [23,67,43,61,72,32,14]
        drowUserAccessNumPie(aAccessNumToBar); */
        /*var adata = [{name:"1次",value:12},{name:"2次",value:21},{name:"3次",value:32},{name:"4次",value:89},{name:">=5次",value:33}];
        var aPieId = ["#UserAccessNum_message","#UserAccessNum_pie"];
        drowUserCountPie(adata,aPieId);*/
       
    }
    /*上线次数饼图数据请求*/
    function UserVisiteCount(StartTime,EndTime)
    {
        /*发送Ajax请求获取来访次数*/
         var nyear = new Date().getFullYear();
         var nmonth = new Date().getMonth();
         var nday = new Date().getDate()+1;
         var nowStartTime = new Date(nyear,nmonth,nday);
         var nowEndTime = new Date(nyear,nmonth,nday,24);
         var sStartTime = StartTime || nowStartTime;
         var sEndTime = EndTime || nowEndTime;
         var SendMsg = {
            url: MyConfig.path + "/useridentity/getUserHistory",
            dataType: "json",
            type: "post",
            data:{ 
                devSNList:g_sn,
                startTime:new Date(sStartTime).toISOString(),
                endTime:new Date(sEndTime).toISOString(),
                skipNum:0,
                limitNum:LIMIT_NUMBER, 
            }, 
            onSuccess:VisiteNumgetMsgSuccess,
            onFailed:VisitegetMsgFail,
        };
        Utils.Request.sendRequest(SendMsg);
        function VisiteNumgetMsgSuccess(data)
        {
            var aUserList = data.userList;
            /*1 将用户id相同的累加起来 为每个用户的访问次数*/
            for(var i=0;i<aUserList.length;i++)
            { 
                if(aUserList[i].com == "true")
                {
                    continue;
                }
                aUserList[i].count = 1;
                for(var j=i+1;j<aUserList.length;j++)
                {
                    if(aUserList[i].userId == aUserList[j].userId)
                    {
                        aUserList[i].count ++;
                        aUserList[j].com = "true";
                    }
                }
            }
            /*2 划分访问次数界线  [小于10次  10~20  20~30 30~40 40~50 50~100 大于100]*/
            var aAccessNumToBar = [0,0,0,0,0];
            for(var i=0;i<aUserList.length;i++)
            {
                if(aUserList[i].count == 1)
                {
                    aAccessNumToBar[0]++;
                }
                if(aUserList[i].count == 2)
                {
                    aAccessNumToBar[1]++;
                }
                if(aUserList[i].count == 3)
                {
                    aAccessNumToBar[2]++;
                }
                if(aUserList[i].count == 4)
                {
                    aAccessNumToBar[3]++;
                }
                if(aUserList[i].count>=5)
                {
                    aAccessNumToBar[4]++;
                }
                 
            }
            var adata = [{name:"1次",value:aAccessNumToBar[0]},{name:"2次",value:aAccessNumToBar[1]},{name:"3次",value:aAccessNumToBar[2]},{name:"4次",value:aAccessNumToBar[3]},{name:">=5次",value:aAccessNumToBar[4]}];
            var aPieId = ["#visiteCount_message","#visiteCount_pie"];
            drowUserCountPie(adata,aPieId);
            $("#visiteonetime").html(aAccessNumToBar[0]+"人");
            $("#visitetwotime").html(aAccessNumToBar[1]+"人");
            $("#visitethretime").html(aAccessNumToBar[2]+"人");
            $("#visitefourtime").html(aAccessNumToBar[3]+"人");
            $("#visitefivetime").html(aAccessNumToBar[4]+"人");
        }
        function VisitegetMsgFail()
        {
            return;
        }
    }
    function dpiData(StartTime,endTime)
    { 
        
        AjaxAppAndUrlPie(StartTime,endTime);
        AjaxDpiChart(StartTime,endTime); 
    }
    function AjaxLocaltionPie()
    { 
       /*欢迎的楼盘*/
       var aPieId = ["#WelcomeType_message","#WelcomeType_pie"]
       var aData = [{name:"图书馆",value:400},{name:"教学楼",value:24},{name:"科技楼",value:25},{name:"美术楼",value:41},{name:"实验楼",value:25}]; 
       drowDpiAndLocaltionPie(aData,aPieId);
       /*不欢迎的楼盘*/
        /*var aPieId = ["#NotWelcomeType_message","#NotWelcomeType_pie"];
       var aData = [{name:"食堂",value:23},{name:"超市",value:24},{name:"KFC",value:25},{name:"麦当劳",value:41},{name:"KTV",value:25}]; 
       drowDpiAndLocaltionPie(aData,aPieId);*/
    }
    function AjaxLocaltionChart()
    {
        /*demo 数据*/ 
        var adata = [
        [12,31,23,43,56,43,67,65,12,34,32],
        [22,33,44,55,33,11,66,77,45,23,21],
        [43,32,12,56,4,67,88,65,34,22,45],
        [21,23,24,52,45,56,54,32,12,89,90],
        [31,23,42,34,54,34,64,5,77,66,34] 
        ];  
        var aTime = ["0:00","1:00","2:00","3:00","4:00","5:00","6:00","7:00","8:00","9:00","10:00"];
        var aName = ["图书馆","教学楼","食堂","超市","科技楼"];
        var aSeries = [];
        var oseries = {
            symbol: "none",
            type: 'line',
            smooth: true,
           // itemStyle: {normal: {areaStyle: {type: 'default'}}},
            name: "",
            data: 0
        };
        
        /*demo*/
        for(var i=0;i<aName.length;i++)
        {
            var oseries = {
                symbol: "none",
                type: 'line',
                smooth: true,
                itemStyle: {normal: {areaStyle: {type: 'default'}}},
                name: "",
                data: 0
            };
            oseries.name = aName[i];
            oseries.data = adata[i]; 
            aSeries.push(oseries);
        }; 
        /*欢迎折线图*/
        var ChartId = "#WelcomeType_chart"
        drowLocaltionAndDpiChart(aTime,aSeries,ChartId);
        /*不欢迎折线图*/
        var ChartId = "#NotWelcomeType_chart"
        drowLocaltionAndDpiChart(aTime,aSeries,ChartId);
         
    }
    function AjaxLocaltionList()
    {
         var aMessage = [{LocalName:"KTV",AccessNum:1,AccessTime:"1小时"},
        {LocalName:"超市",AccessNum:0,AccessTime:"0"}]
         $("#NotWelcomeLocaltion_list").SList ("refresh", aMessage);
    }
    function LocaltionData()
    {
      AjaxLocaltionPie();
      AjaxLocaltionChart();
      AjaxLocaltionList();
    }
    function AjaxGetUserMsg(StartTime,EndTime,start)
    {
          var startTime = getTheDate("one","start");
          var endTime = getTheDate("one","end"); 
          
         var sStartTime = StartTime || startTime;
         var sEndTime = EndTime || endTime;
         var SendMsg = { 
                getUserMsg:{
                    url: MyConfig.path + "/useridentity/getUserHistory",
                    dataType: "json",
                    type: "post", 
                    data: { 
                        devSNList:g_sn,
                        startTime:new Date(sStartTime).toISOString(),
                        endTime:new Date(sEndTime).toISOString(),
                        skipNum:0,
                        limitNum:LIMIT_NUMBER, 
                    },
                    onSuccess:getMsgSuccess,
                    onFailed:getMsgFail
                }
               
            } 
            Utils.Request.sendRequest(SendMsg.getUserMsg);
            function getMsgSuccess(data)
            { 
                g_UserMsg = [];
                var length = data.userList.length;
                /*将获取的用户id  用户名 mac地址保存到全局变量*/
                  for(var i=0;i<length;i++)
                    {
                        var otemp = {userId:"",name:"",macAddr:[],visitTime:[],headimgurl:"",sex:"",age:""};
                        otemp.userId = data.userList[i].userId;
                        otemp.name = data.userList[i].name;
                        otemp.macAddr.push(data.userList[i].macAddr);
                        otemp.visitTime.push(data.userList[i].visitTime);
                        otemp.headimgurl = data.userList[i].headimgurl;
                        otemp.sex = data.userList[i].sex;
                        otemp.age = data.userList[i].age;
                        if(g_UserMsg.length == 0)
                        {
                          g_UserMsg.push(otemp);
                          continue; 
                        }
                        for(var j=0;j<g_UserMsg.length;j++)
                        {
                            if(otemp.userId  == g_UserMsg[j].userId)
                            {  
                                var macLength = g_UserMsg[j].macAddr.length;
                                 /*删除每个用户中MAC地址重复的*/
                                for(var k=0;k<macLength;k++)
                                {
                                    if(g_UserMsg[j].macAddr[k] == otemp.macAddr[0])
                                    {
                                        break;
                                    }
                                    if(k == macLength-1)
                                    {
                                        g_UserMsg[j].macAddr.push(otemp.macAddr[0]);
                                    }
                                }
                                /*将访问时间添加进去*/
                                g_UserMsg[j].visitTime.push(otemp.visitTime[0]);
                                
                                break;
                            }
                            if(j == g_UserMsg.length -1)
                            {
                               g_UserMsg.push(otemp); 
                               break;
                            } 
                        }  
                    }
                    for(var i=0;i<g_UserMsg.length;i++)
                    {
                        var sUserName = g_UserMsg[i].name 
                        for(var j=0;j<g_UserMsg[i].macAddr.length;j++)
                        {  
                            var sMac   = g_UserMsg[i].macAddr[j].slice(0,2)+g_UserMsg[i].macAddr[j].slice(3,5)+"-"+g_UserMsg[i].macAddr[j].slice(6,8)+g_UserMsg[i].macAddr[j].slice(9,11)+"-"+g_UserMsg[i].macAddr[j].slice(12,14)+g_UserMsg[i].macAddr[j].slice(15,17);
                            g_UserMsg[i].macAddr[j] = sMac.toLowerCase();
                        }
                        
                    }

                    /*获取到了所有的要依赖的用户MAC地址 开始初始化其他数据*/
                    /*初始化头部的统计信息*/
                    initHeadMsg(sStartTime,sEndTime); 
                     /*上线用户趋势*/
                    UserVisite_chart(sStartTime,sEndTime);  
            }
            function getMsgFail()
            {
                console.log("fail terminal fail!");
            }  
    }
    function ClickFilter()
    {
         g_SelectTime = $(this).attr('value');
         $("#today,#aweek,#amonth,#year,#otherTime").removeClass("SelectTime"); 
          if(g_SelectTime == "")
            {
                g_SelectTime = "4";
                $("#otherTime").addClass("SelectTime");
            } 
            else
            {
                $(this).addClass("SelectTime");
            }
        switch( g_SelectTime)
        {
            case "0":
            {
                var startTime = getTheDate("one","start");
                var endTime = getTheDate("one","end");
                /*获取用户信息*/ 
                AjaxGetUserMsg(startTime,endTime); 
                /*来访次数*/
                UserAccessNum(startTime,endTime);
                /*新老用户显示比例*/ 
                UserRate(startTime,endTime); 
                /*上线次数*/
                UserVisiteCount(startTime,endTime);
                /*dpi数据分析*/
                dpiData(startTime,endTime);
                /*用户访问趋势*/
                AccessUser_chart(startTime,endTime); 
                /*位置信息*/
                LocaltionData(startTime,endTime);
                break;
            }
            case "1":
            {
                var startTime = getTheDate("aweek","start");
                var endTime = getTheDate("aweek","end");
                /*获取用户信息*/ 
                AjaxGetUserMsg(startTime,endTime);
                /*来访次数*/
                UserAccessNum(startTime,endTime);
                /*新老用户显示比例*/ 
                UserRate(startTime,endTime); 
                /*上线次数*/
                UserVisiteCount(startTime,endTime);
                /*dpi数据分析*/
                dpiData(startTime,endTime);
                /*用户访问趋势*/
                AccessUser_chart(startTime,endTime); 
                /*位置信息*/
                LocaltionData(startTime,endTime); 
                break;
            }
            case "2":
            {
                var startTime = getTheDate("month","start");
                var endTime = getTheDate("month","end"); 
                /*获取用户信息*/
                AjaxGetUserMsg(startTime,endTime);
                /*来访次数*/
                UserAccessNum(startTime,endTime);
                /*新老用户显示比例*/ 
                UserRate(startTime,endTime); 
                /*上线次数*/
                UserVisiteCount(startTime,endTime);
                /*dpi数据分析*/
                dpiData(startTime,endTime);
                /*用户访问趋势*/
                AccessUser_chart(startTime,endTime); 
                /*位置信息*/
                LocaltionData(startTime,endTime);
                break;
            }
            case "3":
            {
                var startTime = getTheDate("year","start");
                var endTime = getTheDate("year","end"); 
                /*获取用户信息*/
                AjaxGetUserMsg(startTime,endTime);
                /*来访次数*/
                UserAccessNum(startTime,endTime);
                /*新老用户显示比例*/ 
                UserRate(startTime,endTime); 
                /*上线次数*/
                UserVisiteCount(startTime,endTime);
                /*dpi数据分析*/
                dpiData(startTime,endTime);
                /*用户访问趋势*/
                AccessUser_chart(startTime,endTime); 
                /*位置信息*/
                LocaltionData(startTime,endTime);
                break;
            }
            default:
            {
                var startTime = $("input[name='daterangepicker_start']").val();
                var endTime = $("input[name='daterangepicker_end']").val();
                var sNowStart = (new Date(Number(startTime.slice(0,4)),Number(startTime.slice(5,7))-1,Number(startTime.slice(8,10)))).getTime();
                var sNowEndTime = (new Date(Number(endTime.slice(0,4)),Number(endTime.slice(5,7))-1,Number(endTime.slice(8,10)),24)).getTime();
                /*获取用户信息*/
                AjaxGetUserMsg(sNowStart,sNowEndTime);
                /*来访次数*/
                UserAccessNum(sNowStart,sNowEndTime); 
                 /*新老用户显示比例*/ 
                UserRate(sNowStart,sNowEndTime); 
                /*上线次数*/
                UserVisiteCount(sNowStart,sNowEndTime);
                /*dpi数据分析*/
                dpiData(sNowStart,sNowEndTime);
                /*用户访问趋势*/
                AccessUser_chart(sNowStart,sNowEndTime); 
                /*位置信息*/
                LocaltionData(sNowStart,sNowEndTime);
                break;
            }
        }
    }
    /*显示上网信息*/
    function SelectNetplay()
    {
        $("#showLocaltionMsg").addClass("hide");
        $("#showNetplayMsg").removeClass("hide");
        switch( g_SelectTime)
        {
            case "0":
            {
                var startTime = getTheDate("one","start");
                var endTime = getTheDate("one","end"); 
                dpiData(startTime,endTime); 
                break;
            }
            case "1":
            {
                var startTime = getTheDate("aweek","start");
                var endTime = getTheDate("aweek","end"); 
                dpiData(startTime,endTime); 
                break;
            }
            case "2":
            {
                var startTime = getTheDate("month","start");
                var endTime = getTheDate("month","end"); 
                dpiData(startTime,endTime); 
                break;
            }
            case "3":
            {
                var startTime = getTheDate("year","start");
                var endTime = getTheDate("year","end"); 
                dpiData(startTime,endTime); 
                break;
            }
            default:
            {
                var startTime = $("input[name='daterangepicker_start']").val();
                var endTime = $("input[name='daterangepicker_end']").val();
                var sNowStart = (new Date(Number(startTime.slice(0,4)),Number(startTime.slice(5,7))-1,Number(startTime.slice(8,10)))).getTime();
                var sNowEndTime = (new Date(Number(endTime.slice(0,4)),Number(endTime.slice(5,7))-1,Number(endTime.slice(8,10)),24)).getTime();
                dpiData(sNowStart,sNowEndTime); 
                break;
            }
        }
           
    }
    /*显示位置信息*/
    function SelectLocation()
    {
        $("#showNetplayMsg").addClass("hide");
        $("#showLocaltionMsg").removeClass("hide");
        LocaltionData();
        
    }
    function initForm()
    {
        /*选择位置信息与上网信息*/
        $("#NetplayMsg").on('click',SelectNetplay);
        $("#LocationMsg").on('click',SelectLocation);
         
         $("#today,#aweek,#amonth,#year,.applyBtn").on("click",ClickFilter); 
    }  
    function initData()
    { 
        /*获取本用户下所有场所的ACSN 其他的请求将依赖于此*/ 
        getACSN();
        /*发送请求获取用户信息*/
      //  AjaxGetUserMsg(); 
        
        /*用户轨迹*/
        /*UserTrailMap();*/

    }
    function initGrid()
    {
        var opt = {
            colNames: getRcText ("LocalName"),
            showHeader: true,
            search:true,
            pageSize:5,
            /*select:{id:"UserInfo",name:"UserInfo:", title: getRcText("URL_NAME"),"options": makeUserSelect, action:onSelectChange},*/
            colModel: [ 
                {name: "LocalName", datatype: "String"},
                {name:"AccessNum",datatype:"String"},
                {name:"AccessTime", datatype:"String"}
            ]
        };
        $("#NotWelcomeLocaltion_list").SList ("head", opt);
          
    }
    function onAjaxErr()
    {
    }
    function _init()
    {

        initForm();
        initGrid();
        initData(); 
    };

    function _destroy()
    {
        Utils.Request.clearMoudleAjax(MODULE_NAME);
    }

    Utils.Pages.regModule(MODULE_NAME, {
        "init": _init,
        "destroy": _destroy,
        "widgets": ["SList","Echart","DateRange","SingleSelect","DateTime"],
        "utils":["Base","Request"]
    });
})( jQuery );

